src/InformationRegisters/УстановленныеПодсистемы/УстановленныеПодсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеПодсистемы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииПодсистем</types>
    </type>
  </resources>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подсистема</name>
    <type>
      <types>CatalogRef.Подсистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УстановленныеРасширенияКонфигураций/УстановленныеРасширенияКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановленныеРасширенияКонфигураций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииРасширенийКонфигураций</types>
    </type>
  </resources>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ХешСумма</name>
    <comment>SHA-1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияРасширений</types>
    </type>
  </resources>
  <resources>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Модифицировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасширениеКонфигурации</name>
    <type>
      <types>CatalogRef.РасширенияКонфигураций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПолученныеДанныеИБ/ПолученныеДанныеИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолученныеДанныеИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВерсииКонфигурацийИБ/ВерсииКонфигурацийИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииКонфигурацийИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРазмещения</name>
    <type>
      <types>EnumRef.ВариантыРазмещенияИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоддержки</name>
    <type>
      <types>EnumRef.СтатусыПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИБ</name>
    <type>
      <types>EnumRef.СтатусыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталогИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>CatalogRef.Серверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТехнологическойПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииТехнологическойПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонУведомленияПодключение</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ИнформационныеБазы/Module.bsl
Функция НайтиЭлементПоИдентификатору(ИдентификаторИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформационныеБазы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	ИнформационныеБазы.ИдентификаторИБ = &ИдентификаторИБ";
	Запрос.УстановитьПараметр("ИдентификаторИБ", ИдентификаторИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ИнформационныеБазы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция УстановленныеПодсистемы(СсылкаИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеПодсистемы.Подсистема КАК Подсистема,
		|	УстановленныеПодсистемы.Версия КАК Версия,
		|	УстановленныеПодсистемы.Исключить КАК Исключить
		|ИЗ
		|	РегистрСведений.УстановленныеПодсистемы.СрезПоследних(, ИнформационнаяБаза = &ИБ) КАК УстановленныеПодсистемы
		|ГДЕ
		|	НЕ УстановленныеПодсистемы.Исключить";
	
	Запрос.УстановитьПараметр("ИБ", СсылкаИБ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция УстановленныеРасширенияКонфигурации(СсылкаИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеРасширенияКонфигураций.РасширениеКонфигурации КАК РасширениеКонфигурации,
		|	УстановленныеРасширенияКонфигураций.Версия КАК Версия,
		|	УстановленныеРасширенияКонфигураций.Исключить КАК Исключить,
		|	УстановленныеРасширенияКонфигураций.ХешСумма КАК ХешСумма,
		|	УстановленныеРасширенияКонфигураций.Активно КАК Активно,
		|	УстановленныеРасширенияКонфигураций.Назначение КАК Назначение,
		|	УстановленныеРасширенияКонфигураций.БезопасныйРежим КАК БезопасныйРежим,
		|	УстановленныеРасширенияКонфигураций.Модифицировано КАК Модифицировано
		|ИЗ
		|	РегистрСведений.УстановленныеРасширенияКонфигураций.СрезПоследних(, ИнформационнаяБаза = &ИБ) КАК УстановленныеРасширенияКонфигураций
		|ГДЕ
		|	НЕ УстановленныеРасширенияКонфигураций.Исключить";
	
	Запрос.УстановитьПараметр("ИБ", СсылкаИБ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗафиксироватьПодсистему(СсылкаИБ, Подсистема, Версия, Исключить, Период) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.УстановленныеПодсистемы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.ИнформационнаяБаза = СсылкаИБ;
	МенеджерЗаписи.Подсистема = Подсистема;
	МенеджерЗаписи.Версия = Версия;
	МенеджерЗаписи.Исключить = Исключить;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ЗафиксироватьРасширениеКонфигурации(СсылкаИБ, Расширение, Версия, Исключить, ХешСумма, Активно, Назначение, БезопасныйРежим, Модифицировано, Период) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.УстановленныеРасширенияКонфигураций.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.ИнформационнаяБаза = СсылкаИБ;
	МенеджерЗаписи.РасширениеКонфигурации = Расширение;
	МенеджерЗаписи.Версия = Версия;
	МенеджерЗаписи.Исключить = Исключить;
	МенеджерЗаписи.ХешСумма = ХешСумма;
	МенеджерЗаписи.Активно = Активно;
	МенеджерЗаписи.Назначение = Назначение;
	МенеджерЗаписи.БезопасныйРежим = БезопасныйРежим;
	МенеджерЗаписи.Модифицировано = Модифицировано;
	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры 

Процедура УстановитьБлокировку(ИдентификаторИБ, СсылкаИБ) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ИнформационныеБазы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторИБ", ИдентификаторИБ);
	
	Если НЕ СсылкаИБ.Пустая() Тогда
	
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПолученныеДанныеИБ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УстановленныеПодсистемы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УстановленныеРасширенияКонфигураций");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВерсииКонфигурацийИБ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИнформационнаяБаза", СсылкаИБ);
	
	КонецЕсли;
	
	Блокировка.Заблокировать();
	
КонецПроцедуры
